In [1]:
# Answer number 1:-

In [5]:
import pandas as pd

In [9]:
# head()
data = {'Name':['Manu','Kovid','Mayank','Ruchi'],
        'Age' :[20,28,24,25]}
df = pd.DataFrame(data)
df.head(3)

     Name  Age
0    Manu   20
1   Kovid   28
2  Mayank   24

In [8]:
# info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [10]:
# describe()
df.describe()

             Age
count   4.000000
mean   24.250000
std     3.304038
min    20.000000
25%    23.000000
50%    24.500000
75%    25.750000
max    28.000000

In [14]:
# sort_values()
sorted_df = df.sort_values('Age')
sorted_df

     Name  Age
0    Manu   20
2  Mayank   24
3   Ruchi   25
1   Kovid   28

In [15]:
# drop()
dropped_df = df.drop('Age',axis=1)
dropped_df

     Name
0    Manu
1   Kovid
2  Mayank
3   Ruchi

In [18]:
# Answer number 2:-

In [30]:
data = {'Name':['Manu','Kovid','Mayank','Ruchi'],
        'Age' :[20,28,24,25]}
df = pd.DataFrame(data)
new_index = range(1,2*len(df)+1,2)
df.index = new_index
df

     Name  Age
1    Manu   20
3   Kovid   28
5  Mayank   24
7   Ruchi   25

In [35]:
# Answer number 3:-

In [34]:
data = {'values':[10,20,35,6]}
df = pd.DataFrame(data)
total_sum = 0
for i in range(min(3,len(df))):
    total_sum += df['values'].iloc[i]
print(total_sum)

65

In [36]:
# Answer number 4:-

In [37]:
data = {'Text': ['Hello world', 
                 'Pandas is great for data analysis', 
                 'This is an example']}
df = pd.DataFrame(data)
df['word_count'] = df['Text'].apply(lambda x: len(x.split()))
df

                                Text  word_count
0                        Hello world           2
1  Pandas is great for data analysis           6
2                 This is an example           4

In [38]:
# Answer number 5:-

In [42]:
# DataFrame.size:- it returns the total number of elements as an integer.
# DataFrame.shape:- it returns the number of rows and columns as in tuple.

# Example:-
data = {'A':[2,4,9,8],'B':[3,5,4,8]}
df = pd.DataFrame(data)
df.size

8

In [43]:
df.shape

(4, 2)

In [44]:
# Answer number 6:-

In [ ]:
pd.read_excel()is to read an excel file.

In [45]:
# Answer number 7:-

In [53]:
data = {'email':['manusachan@gmail.com','kovidkrishnan@gmail.com']}
df = pd.DataFrame(data)
df['username'] = df['email'].apply(lambda x:x.split('@')[0])
df

                     email       username
0     manusachan@gmail.com     manusachan
1  kovidkrishnan@gmail.com  kovidkrishnan

In [54]:
# Answer number 8:-

In [55]:
data = {'A': [3, 7, 10, 2, 6],
        'B': [8, 12, 9, 5, 7],
        'C': ['X', 'Y', 'Z', 'W', 'V']}
df = pd.DataFrame(data)
filter_ = df[(df['A'] > 5) & (df['B'] < 10)]
filter_

    A  B  C
2  10  9  Z
4   6  7  V

In [56]:
# Answer number 9:-

In [61]:
data = {'values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
mean = df['values'].mean()
median = df['values'].median()
sd = df['values'].std()
print(mean)
print(median)
print(sd)

30.0
30.0
15.811388300841896

In [62]:
# Answer number 10:-

In [66]:
data = {'Date': pd.date_range(start='2023-10-01', periods=10),
        'Sales': [200, 220, 250, 230, 210, 300, 310, 280, 290, 320]}
df = pd.DataFrame(data)
df['MovingAverage']=df['Sales'].rolling(window=7).mean()
df

        Date  Sales  MovingAverage
0 2023-10-01    200            NaN
1 2023-10-02    220            NaN
2 2023-10-03    250            NaN
3 2023-10-04    230            NaN
4 2023-10-05    210            NaN
5 2023-10-06    300            NaN
6 2023-10-07    310     245.714286
7 2023-10-08    280     257.142857
8 2023-10-09    290     267.142857
9 2023-10-10    320     277.142857

In [67]:
# Answer number 11:-

In [70]:
data = {
    'Date': ['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04']
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
df['weekday']=df['Date'].dt.day_name()
df

        Date    weekday
0 2023-10-01     Sunday
1 2023-10-02     Monday
2 2023-10-03    Tuesday
3 2023-10-04  Wednesday

In [71]:
# Answer number 12:-

In [72]:
data = {
    'Date': ['2023-01-15', '2023-01-20', '2023-02-01', '2023-01-30', '2023-02-15']
}
df = pd.DataFrame(data)
start_date = '2023-01-01'
end_date = '2023-01-31'
filter_ = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
filter_

         Date
0  2023-01-15
1  2023-01-20
3  2023-01-30

In [73]:
# Answer number 13:-

In [ ]:
To use the basic functions of pandas,we need to import the pandas library itself like this-
import pandas as pd